consp/lcd8-re/src/hal/lcd8h/at32f435/lcd.c
#include "at32f435_437.h"
#include "lcd.h"
#include "hal/lcd8/at32f435/lcd.h"
#include "uart.h"
#include <cmsis/core/cmsis_gcc.h>
#include <string.h>
#include <stdio.h>
#include "config.h"

/* #define MEMORY_DEBUG */
uint16_t dummy = 0;


#ifdef DMA_WRITE

#if LVGL_VERSION_MAJOR == 9
static lv_display_t *dp = NULL;
#else
static lv_disp_drv_t *dp = NULL;
#endif
volatile int dma_ready = 1;
void dma_write(uint16_t *data, uint32_t length, lv_area_t *area);
#endif

typedef struct ili_cmd_t {
    uint8_t cmd;
    uint8_t data[16];
    uint32_t data_length;
} ili_cmd;
#define STARTUP_COMMAND_LENGTH 14
const ili_cmd ili_startup_cmds[STARTUP_COMMAND_LENGTH] = {
		{ILI_POSITIVE_GAMMA_CORRECTION,     {0x00, 0x09, 0x16, 0x09, 0x17, 0x0A, 0x3F, 0x78, 0x4B, 0x07, 0x0E, 0x0F, 0x18, 0x1A, 0x0F}, 15}, // panel specific
		{ILI_NEGATIVE_GAMMA_CORRECTION,     {0x00, 0x1D, 0x1F, 0x05, 0x0F, 0x05, 0x33, 0x34, 0x43, 0x02, 0x0A, 0x08, 0x2E, 0x33, 0x0F}, 15}, // panel specific
        {ILI_FRAME_RATE_CONTROL_NORMAL,     {0xA0}, 1}, // Fosc,78.13hz
        {ILI_DISPLAY_INVERSION_CONTROL,     {0x02}, 1}, // 2 dot inversion 
        {ILI_POWER_CONTROL_1,               {0x12, 0x12}, 2}, // +/- 4.6895
        {ILI_POWER_CONTROL_2,               {0x41}, 1}, // VCI*6/VCI*4
        {ILI_VCOM_CONTROL_1,                {0x00, 0x25, 0x80}, 3}, // [ignore NV byte] [-1.35938] [read from vcomreg] last byte is NV memory programmed and ignored
		{ILI_DISPLAY_FUNCTION_CONTROL,      {0x02}, 1}, // if correct only sets first byte to non display area AGND 
		{ILI_DISPLAY_FUNCTION_CONTROL,      {0x02, 0x02, 0x3B}, 3},
		{ILI_MEMORY_ACCESS_CONTROL,         {0x48}, 1}, // Column inverted, BGR filters
		{ILI_INTERFACE_PIXEL_FORMAT,        {0x55}, 1}, // RGB565
        {ILI_SET_IMAGE_FUNCTION,            {0x00}, 1}, // Disable 24bit mode
        {ILI_ADJUST_CONTROL_3,              {0xA9, 0x51, 0x2C, 0x82}, 4},// default (only one bit can be changed)
		{ILI_WRITE_DISPLAY_BRIGHTNESS,      {0x7F}, 1}
        //

        /* {ILI_POWER_CONTROL_2,               {0x44}, 1}, */
		/* {ILI_VCOM_CONTROL_1,                {0x00, 0x22, 0x80, 0x44}, 4}, */
		/* {ILI_MEMORY_ACCESS_CONTROL,         {(0x20 | 0x08)}, 1}, */
		/* {ILI_INTERFACE_PIXEL_FORMAT,        {0x55}, 1}, */
		/* {ILI_INTERFACE_MODE_CONTROL,        {0x00}, 1}, */
		/* {ILI_FRAME_RATE_CONTROL_NORMAL,     {0xB0, 0x11}, 2}, */
		/* {ILI_DISPLAY_INVERSION_CONTROL,     {0x02}, 1}, */
		/* {ILI_DISPLAY_FUNCTION_CONTROL,      {0x02, 0x02, 0x3B}, 3}, */
		/* {ILI_SET_IMAGE_FUNCTION,            {0x00}, 1}, */
		/* {ILI_WRITE_CTRL_DISPLAY,            {0x28}, 1}, */
		/* {ILI_WRITE_DISPLAY_BRIGHTNESS,      {0x7F}, 1}, */
};

static void write_data_8bit(uint8_t data);
static void write_cmd(uint8_t data);
static void write_data(uint16_t data);
static void lcd_set_address_window(uint32_t x, uint32_t y, uint32_t x2, uint32_t y2);

void lcd_backlight_init(void) {
    crm_periph_clock_enable(CRM_TMR3_PERIPH_CLOCK, TRUE);

    tmr_base_init(TMR3, 100-1, TIMER_FREQ(10000000)); 
    /* tmr_base_init(TMR3, 10000-1, 1000000); // 10khz? */
    tmr_cnt_dir_set(TMR3, TMR_COUNT_UP);
    tmr_clock_source_div_set(TMR3, TMR_CLOCK_DIV1);

    tmr_output_config_type tmr_oc_init_structure;
    tmr_output_default_para_init(&tmr_oc_init_structure);
    tmr_oc_init_structure.oc_mode = TMR_OUTPUT_CONTROL_PWM_MODE_A;
    tmr_oc_init_structure.oc_idle_state = FALSE;
    tmr_oc_init_structure.oc_polarity = TMR_OUTPUT_ACTIVE_HIGH;
    tmr_oc_init_structure.oc_output_state = TRUE;
    tmr_output_channel_config(TMR3, TMR_SELECT_CHANNEL_2, &tmr_oc_init_structure);
    tmr_channel_value_set(TMR3, TMR_SELECT_CHANNEL_2, 0);
    tmr_output_channel_buffer_enable(TMR3, TMR_SELECT_CHANNEL_2, TRUE);
    tmr_period_buffer_enable(TMR3, TRUE);

    /* tmr enable counter */
    tmr_counter_enable(TMR3, TRUE);
}

void lcd_tmr_init(void) {
}

void lcd_init(void) {
    
    crm_periph_clock_enable(CRM_GPIOA_PERIPH_CLOCK, TRUE); // we use all channels
    crm_periph_clock_enable(CRM_GPIOB_PERIPH_CLOCK, TRUE); // we use all channels
    crm_periph_clock_enable(CRM_GPIOC_PERIPH_CLOCK, TRUE); // we use all channels
    gpio_init_type gpio_initstructure;
    // remap
    /* crm_periph_clock_enable(CRM_IOMUX_PERIPH_CLOCK, TRUE); */
    /* gpio_pin_remap_config(SWJTAG_GMUX_010, TRUE); */

    gpio_initstructure.gpio_out_type       = GPIO_OUTPUT_PUSH_PULL;
    gpio_initstructure.gpio_pull           = GPIO_PULL_NONE; // external pullup
    gpio_initstructure.gpio_mode           = GPIO_MODE_OUTPUT;
    gpio_initstructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
    gpio_initstructure.gpio_pins           = GPIO_PINS_ALL;
    gpio_init(GPIOB, &gpio_initstructure);

    GPIOB->odt = 0xFFFF;

  // Backlight pin, pwm 
    gpio_initstructure.gpio_out_type       = GPIO_OUTPUT_PUSH_PULL;
    gpio_initstructure.gpio_pull           = GPIO_PULL_NONE; // external pullup
    gpio_initstructure.gpio_mode           = GPIO_MODE_MUX;
    gpio_initstructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
    gpio_initstructure.gpio_pins           = GPIO_PINS_7;
    gpio_init(GPIOA, &gpio_initstructure);

    gpio_pin_mux_config(GPIOA, GPIO_PINS_SOURCE7, GPIO_MUX_2);
    crm_periph_clock_enable(CRM_TMR3_PERIPH_CLOCK, TRUE);
    lcd_backlight_init();

    // init clocks

    // Read strobe
    gpio_initstructure.gpio_out_type       = GPIO_OUTPUT_PUSH_PULL;
    gpio_initstructure.gpio_pull           = GPIO_PULL_NONE; // external pullup
    gpio_initstructure.gpio_mode           = GPIO_MODE_OUTPUT;
    gpio_initstructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
    gpio_initstructure.gpio_pins           = PIN_READ;
    gpio_init(GPIOC, &gpio_initstructure);

    // Write strobe
    gpio_initstructure.gpio_out_type       = GPIO_OUTPUT_PUSH_PULL;
    gpio_initstructure.gpio_pull           = GPIO_PULL_NONE; // external pullup
    gpio_initstructure.gpio_mode           = GPIO_MODE_OUTPUT;
    gpio_initstructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
    gpio_initstructure.gpio_pins           = PIN_WRITE;
    gpio_init(GPIOC, &gpio_initstructure);

    // Command/Data
    gpio_initstructure.gpio_out_type       = GPIO_OUTPUT_PUSH_PULL;
    gpio_initstructure.gpio_pull           = GPIO_PULL_NONE; // external pullup
    gpio_initstructure.gpio_mode           = GPIO_MODE_OUTPUT;
    gpio_initstructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
    gpio_initstructure.gpio_pins           = PIN_CD;
    gpio_init(GPIOC, &gpio_initstructure);

    // cs
    gpio_initstructure.gpio_out_type       = GPIO_OUTPUT_PUSH_PULL;
    gpio_initstructure.gpio_pull           = GPIO_PULL_NONE; // external pullup
    gpio_initstructure.gpio_mode           = GPIO_MODE_OUTPUT;
    gpio_initstructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
    gpio_initstructure.gpio_pins           = PIN_CS;
    gpio_init(GPIOC, &gpio_initstructure);

