consp/lcd8-re/src/hal/lcd8h/at32f435/lcd.c
    //CLEAR_DATA();

    GPIOC->odt |= PIN_READ | PIN_WRITE | PIN_CD | PIN_CS; // force all high
    SET_WRITE();
    /* CS_ACTIVE; */

    WRITE_IDLE;


#ifdef DMA_WRITE

    crm_periph_clock_enable(CRM_DMA2_PERIPH_CLOCK, TRUE);
    crm_periph_clock_enable(CRM_TMR8_PERIPH_CLOCK, TRUE);

    gpio_pin_mux_config(GPIOC, GPIO_PINS_SOURCE9,  GPIO_MUX_3);

    static dma_init_type dma_init_struct = {0};

    tmr_reset(TMR8);
    /* tmr enable counter */
    tmr_output_config_type tmr_output_struct;
    tmr_base_init(TMR8, 15, 0);
    /* tmr_base_init(TMR8, 11, 0); */
    tmr_cnt_dir_set(TMR8, TMR_COUNT_UP);
    tmr_clock_source_div_set(TMR8, TMR_CLOCK_DIV1);
    tmr_output_default_para_init(&tmr_output_struct);
    tmr_output_struct.oc_mode = TMR_OUTPUT_CONTROL_PWM_MODE_B;
    tmr_output_struct.oc_output_state = TRUE;
    tmr_output_struct.oc_polarity = TMR_OUTPUT_ACTIVE_LOW;
    tmr_output_struct.oc_idle_state = TRUE;
    tmr_output_channel_config(TMR8, TMR_SELECT_CHANNEL_4, &tmr_output_struct);
    tmr_channel_value_set(TMR8, TMR_SELECT_CHANNEL_4, 9);
    /* tmr_channel_value_set(TMR8, TMR_SELECT_CHANNEL_4,  8); */

    /* tmr_interrupt_enable(TMR8, TMR_OVF_INT, TRUE); */

    /* tmr_dma_request_enable(TMR8, TMR_C4_DMA_REQUEST, TRUE); */
    tmr_dma_request_enable(TMR8, TMR_OVERFLOW_DMA_REQUEST, TRUE);

    dma_reset(DMA2_CHANNEL1);
    dma_init_struct.buffer_size = 0;
    dma_init_struct.direction = DMA_DIR_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_base_addr = 0;
    dma_init_struct.memory_data_width = DMA_MEMORY_DATA_WIDTH_HALFWORD;
    dma_init_struct.memory_inc_enable = TRUE;
    dma_init_struct.peripheral_base_addr = (uint32_t)&GPIOB->odt;
    dma_init_struct.peripheral_data_width = DMA_PERIPHERAL_DATA_WIDTH_HALFWORD;
    dma_init_struct.peripheral_inc_enable = FALSE;
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init_struct.loop_mode_enable = FALSE;
    dma_init(DMA2_CHANNEL1, &dma_init_struct);

    dma_interrupt_enable(DMA2_CHANNEL1, DMA_FDT_INT, TRUE);
    nvic_priority_group_config(NVIC_PRIORITY_GROUP_4);
    nvic_irq_enable(DMA2_Channel1_IRQn, 0, 0);
    nvic_irq_enable(TMR8_OVF_TMR13_IRQn, 1, 0);

    
    dmamux_enable(DMA2, TRUE);
    dmamux_init(DMA2MUX_CHANNEL1, DMAMUX_DMAREQ_ID_TMR8_OVERFLOW);
    dma_channel_enable(DMA2_CHANNEL1, TRUE);
    /* dma_flexible_config(DMA2, FLEX_CHANNEL1, DMA_FLEXIBLE_TMR8_CH4); */
    /* dma_flexible_config(DMA2, FLEX_CHANNEL1, DMA_FLEXIBLE_TMR8_OVERFLOW); */
    
    TMR8->brk_bit.oen = 1;

    /* while(1) { */
    /*     dma_write(dma_test_data, 16); */
    /*     delay_us(10); */
    /* } */
#endif

    CS_ACTIVE;
}
#ifdef DMA_WRITE

uint32_t dma_final_x = 0;
uint32_t dma_final_y = 0;
uint16_t *dma_final_bytes = NULL;
uint32_t dma_total = 0;
uint32_t dma_partial = 0;
uint8_t *dma_data = NULL;
lv_area_t dma_area = {0};

// if the pixbuffer is the full display we do not care about overdraw
CRITICAL void dma_write(uint16_t *data, uint32_t length, lv_area_t *area) {
    dma_ready = 0;
    dma_total = length << 1;
    dma_data = (uint8_t *) data;
    memcpy(&dma_area, area, sizeof(lv_area_t));

    /* if (dma_partial) lcd_set_address_window(0, area->y1 + (100 * dma_partial), 319, (area->y1 + (100 * dma_partial) + 100)); */
    lcd_set_address_window(0, dma_area.y1, 319, dma_area.y2);
    write_cmd(ILI_MEMORY_WRITE);
    DATA;
#if X_BACKOFF
    dma_final_x = final_x - (X_BACKOFF - 1);
    dma_final_y = final_y;
    dma_final_bytes = data + length - (1 + X_BACKOFF);
#endif
    tmr_flag_clear(TMR8, TMR_OVF_FLAG);
    tmr_flag_clear(TMR8, TMR_C4_FLAG);
    GPIOC->clr = 1 << 9;
    TMR8->cval = 0;
    // force first blob
    GPIOB->odt = *data; // initial blob
    /* data++; */
    DMA2_CHANNEL1->ctrl_bit.chen = 0;
#if X_BACKOFF
    DMA2_CHANNEL1->dtcnt = length - (1 + X_BACKOFF); // skip first and last
#else
    if (length < 64000) {
        DMA2_CHANNEL1->dtcnt = length; 
        dma_partial = 0;
    } else {
        DMA2_CHANNEL1->dtcnt = 64000;
        dma_partial = 64000;
    }
    // at high speeds the first pixel will be invalid (0)
    // but due to it looping at least one pixel it will always be drawn
    // The first pixel is thus drawn twice: once wrong, once correct
#endif
    DMA2_CHANNEL1->maddr = (uint32_t) (dma_data);
    DMA2_CHANNEL1->ctrl_bit.chen = 1;
    TMR8->ctrl1_bit.tmren = 1;
    GPIOC->cfgr &= (uint32_t)~(0x3 << 18);
    GPIOC->cfgr |= (uint32_t) (0x2 << 18);
}

/* void TMR8_OVF_TMR80_IRQHandler(void) */
/* { */
/*     // ssytem is high */
/*     TMR8->ists = ~TMR_OVF_FLAG; */
/*     if (++tmr_cnt == tmr_end) TMR8->ctrl1_bit.tmren = 0; */
/* } */

// there is no way to capture the last pulses (as in: block them)
// So we stop writing 1 blob earlier and finish it manually
// This costs one setup cycle and one byte burst
CRITICAL void DMA2_Channel1_IRQHandler(void)
{
    __disable_irq();
    CS_IDLE;
    WRITE_IDLE;

    GPIOC->cfgr &= (uint32_t)~(0x3 << 18);
    GPIOC->cfgr |= (uint32_t) (0x1 << 18);
    TMR8->ctrl1_bit.tmren = 0;
    DMA2->clr = DMA2_FDT1_FLAG;
    CS_ACTIVE;
#if X_BACKOFF
    // this is a medium-long one, reset column, row is correct
    write_cmd(ILI_COL_ADDR_SET);
    write_data_8bit(dma_final_x   >> 8);
    write_data_8bit(dma_final_x  );
    write_data_8bit((dma_final_x + (X_BACKOFF - 1)) >> 8);
    write_data_8bit(dma_final_x + (X_BACKOFF - 1));
    write_cmd(ILI_PA_ADDR_SET);
    write_data_8bit(dma_final_y >> 8);
    write_data_8bit(dma_final_y);
    write_data_8bit((dma_final_y) >> 8);
    write_data_8bit(dma_final_y);
    write_cmd(ILI_MEMORY_WRITE);
    // unroll to avoid unneeded branches
#pragma GCC unroll 32
    for (int i = 0; i < X_BACKOFF; i++) write_data(*dma_final_bytes++);
#endif
    if (dma_partial) {
        uint32_t length = dma_total - dma_partial;
        dma_area.y1 += 100;
        dma_area.y2 += 100;
        if (dma_area.y2 > DISPLAY_WIDTH) dma_area.y2 = DISPLAY_HEIGHT - 1;
        dma_write((uint16_t *) (dma_data + dma_partial), length >> 1, &dma_area);
    } else {
        dma_ready = 1;
#if LVGL_VERSION_MAJOR == 9
        if (NULL != dp) lv_display_flush_ready(dp);
#else
        if (NULL != dp) lv_disp_flush_ready(dp);
#endif
    }
    __enable_irq();
}
#endif

int memcpy_dma(const uint8_t *target, const uint8_t *source, const uint32_t length) {
    return 0;
}

CRITICAL void lcd_backlight(uint32_t value) { // 0-100
    tmr_channel_value_set(TMR3, TMR_SELECT_CHANNEL_2, value);
}

