consp/lcd8-re/src/hal/lcd8h/at32f435/lcd.c
static void write_cmd(uint8_t command) {
    COMMAND;
    /* CS_ACTIVE; */
    READ_IDLE;
    WRITE_ACTIVE;
    WRITE_8BIT(command);
    DELAY_NOP_6;
    WRITE_IDLE;
    /* DELAY_NOP_6; */
    /* CS_IDLE; */
    /* CLEAR_DATA(); */
}

static inline void write_data(uint16_t data) {
    DATA;
    //CS_ACTIVE;
    READ_IDLE;
    WRITE_ACTIVE;
    WRITE_16BIT(data);
    DELAY_NOP_6;
    WRITE_IDLE;
    /* DELAY_NOP_6; */
    //CS_IDLE;
    /* CLEAR_DATA(); */
}

static inline void write_data_8bit(uint8_t data) {
    DATA;
    //CS_ACTIVE;
    READ_IDLE;
    WRITE_ACTIVE;
    WRITE_8BIT(data);
    DELAY_NOP_6;
    WRITE_IDLE;
    /* DELAY_NOP_6; */
    //CS_IDLE;
    /* CLEAR_DATA(); */
}

static inline void read_data_16bit(uint16_t *data) {
    DATA;
    //CS_ACTIVE;
    WRITE_IDLE;
    READ_ACTIVE;
    DELAY_NOP_200;
    DELAY_NOP_200;
    *data = GPIOB->idt & 0xFFFF;
    DELAY_NOP_50;
    READ_IDLE;
    DELAY_NOP_50;
    //CS_IDLE;
    DELAY_NOP_50;
}

static inline void read_data_8bit(uint8_t *data) {
    DATA;
    //CS_ACTIVE;
    WRITE_IDLE;
    READ_ACTIVE;
    DELAY_NOP_200;
    DELAY_NOP_200;
    READ_IDLE;
    *data = GPIOB->idt & 0x00FF;
    DELAY_NOP_50;
    //CS_IDLE;
    DELAY_NOP_50;
}

CRITICAL void read_register(uint8_t command, void *location, uint32_t bits, uint32_t num) {
    SET_WRITE();
    DELAY_NOP_20;
    write_cmd(command);
    CLEAR_DATA();
    SET_READ();
    /* //CS_ACTIVE; */
    if (bits) {
        uint16_t *location_16 = (uint16_t *) location;
        while (num--) {
            read_data_16bit(location_16++);
        }
    } else {
        uint8_t *location_8 = (uint8_t *) location;
        while (num--) {
            read_data_8bit(location_8++);
        }
    }
    /* //CS_IDLE; */
    SET_WRITE();
}


CRITICAL static void lcd_set_address_window(uint32_t x, uint32_t y, uint32_t x2, uint32_t y2) {
    write_cmd(ILI_COL_ADDR_SET);
    write_data_8bit(x >> 8);
    write_data_8bit(x);
    write_data_8bit(x2 >> 8);
    write_data_8bit(x2);

    write_cmd(ILI_PA_ADDR_SET);
    write_data_8bit(y >> 8);
    write_data_8bit(y);
    write_data_8bit(y2 >> 8);
    write_data_8bit(y2);
}

CRITICAL void lcd_command(uint8_t cmd) {
    write_cmd(cmd);
}

CRITICAL void lcd_draw_data(uint16_t *data, ssize_t length) {
#ifdef USE_TMR_INT
    // check if available
    while (TMR8->ctrl1_bit.tmren == 1 && TMR8->brk_bit.oen == 1);
#endif
    write_cmd(ILI_MEMORY_WRITE);
#ifdef USE_TMR_INT
    write_data_tmr_int(data, length, 1);
#else
    while (length--) write_data(*data++);
#endif
}

CRITICAL int detect_lcd(void) {
    // ili9488 has D3 register
    uint8_t data[4] = {0};
    read_register(0xD3, &data, 0, 4);
    if (data[1] == 0x00 && data[2] == 0x94 && data[3] == 0x88) {
        // correct ID4 for 9488
        return 1;
    }
    return 0;
}

/*
 * ugui accelerator functions
 */
#if 0
void lcd_draw(UG_S16 x, UG_S16 y, UG_COLOR color) {
    lcd_set_address_window(x, y, x+1, y);
    write_cmd(ILI_MEMORY_WRITE);
    write_data(color);
}

UG_RESULT lcd_draw_line(UG_S16 x1, UG_S16 y1, UG_S16 x2, UG_S16 y2, UG_COLOR color) {
    return lcd_fill(x1, y1, x2, y2, color);
}


UG_RESULT lcd_fill(UG_S16 x1, UG_S16 y1, UG_S16 x2, UG_S16 y2, UG_COLOR color) {
   lcd_set_address_window(x1, y1, x2, y2);
   write_cmd(ILI_MEMORY_WRITE);
   lcd_fill_pixels(((x2-x1) + 1) * ((y2-y1) + 1), color);
   return UG_RESULT_OK;
}


void (*lcd_fill_area(UG_S16 x1, UG_S16 y1, UG_S16 x2, UG_S16 y2))(uint32_t, UG_COLOR) {
    lcd_set_address_window(x1, y1, x2, y2);
    write_cmd(ILI_MEMORY_WRITE);
    return lcd_fill_pixels;
}

UG_RESULT lcd_draw_bmp(UG_S16 x, UG_S16 y, UG_BMP *bmp) {
    uint16_t x2 = x + bmp->width - 1;
    uint16_t y2 = y + bmp->height - 1;

    if (x2 > DISPLAY_WIDTH) x = DISPLAY_WIDTH - 1;
    if (y2 > DISPLAY_HEIGHT) y = DISPLAY_HEIGHT - 1;
    lcd_set_address_window(x, y, x2, y2);
    lcd_draw_data((uint16_t *)bmp->p, bmp->width * bmp->height);
    return UG_RESULT_OK;
}
#endif

CRITICAL void lcd_fill_pixels(uint32_t length, uint16_t color) {
    while(length--) write_data(color);
}

CRITICAL void lcd_fill(uint32_t x1, uint32_t y1, uint32_t x2, uint32_t y2, uint16_t color) {
   lcd_set_address_window(x1, y1, x2, y2);
   write_cmd(ILI_MEMORY_WRITE);
   lcd_fill_pixels(((x2-x1) + 1) * ((y2-y1) + 1), color);
}

// does nothing, we do not have a frame buffer
void lcd_update(void) {
}


int lcd_start(void) {

    CS_IDLE;
    DELAY_NOP_20;
    CS_ACTIVE;
    DELAY_NOP_20;

    delay_ms(50);
    write_cmd(0x00);
    write_data(0x0001);
    write_cmd(ILI_SLEEP_OUT);
    delay_ms(170);
    if (!detect_lcd()) {
        return 0;
    }

    for (int i = 0; i < STARTUP_COMMAND_LENGTH; i++) {
        write_cmd(ili_startup_cmds[i].cmd);
        for (int x = 0; x < ili_startup_cmds[i].data_length; x++) {
            write_data_8bit(ili_startup_cmds[i].data[x]);
        }
    }
    write_cmd(ILI_SLEEP_OUT);
    delay_ms(120);
    write_cmd(ILI_DISPLAY_ON);
    delay_ms(200); // 186?
   
    lcd_set_address_window(0, 0, 319, 479);
    write_cmd(ILI_MEMORY_WRITE);
    lcd_fill(0, 0, 320, 480, RGB(255, 0, 0));
    return 1;
}

void lcd_test(void) {
    write_cmd(0x55);
    write_data_8bit(0xAA);
    for (int i = 0; i <= 255; i++) {
        WRITE_16BIT(i);
        delay_10ns(1);
    }
    for (int i = 0; i <= 65536; i++) {
        WRITE_8BIT(0b00011100);
        DELAY_NOP_6;
        WRITE_8BIT(0);
        DELAY_NOP_6;
    }
    WRITE_16BIT(0xFFFF);
}

lv_area_t nar;
uint32_t nl;
#if LVGL_VERSION_MAJOR == 9
CRITICAL void lcd_lvgl_flush(lv_display_t *display, const lv_area_t *area, uint8_t *pixmap) {
/*     lv_display_flush_ready(display); */
/*     return; */
/* } */
/* CRITICAL void lcd_flush(lv_display_t *display, lv_area_t *area, uint8_t *pixmap) { */
#else
CRITICAL void lcd_lvgl_flush(lv_disp_drv_t *display, const lv_area_t *area, lv_color_t *pixmap) { 
#endif
#if LVGL_VERSION_MAJOR == 9
    uint32_t length = 0;
    length = 320 * (area->y2 - area->y1) + 1;
    /* length *= ((area->x2 - area->x1) + 1); */
    memcpy(&nar, area, sizeof(lv_area_t));
    nl = length;
    /* if (length % 2 == 1) { */
    /*     // if odd there is a x-1 offset for some reason */
    /*     length = (area->y2 - area->y1) + 1; */
    /*     length *= ((area->x2 - area->x1) + 2); */
    /* } */
    pixmap = (pixmap + (((area->y1 * DISPLAY_WIDTH)) * 2));
    uint16_t *pixels = (uint16_t *) pixmap;
#endif                                                    
#ifdef DMA_WRITE 
#pragma message "Using DMA"
    dp = display;
    dma_total = length; // if size > 65k it cannot be drawn in one go
    dma_write(pixels, nl, &nar);
#else
    write_cmd(ILI_MEMORY_WRITE);
    lcd_set_address_window(area->x1, area->y1, area->x2, area->y2);
/* #pragma GCC unroll 8 */
    while(length--) write_data(*pixels++);

#if LVGL_VERSION_MAJOR == 9
    if (display != NULL) lv_display_flush_ready(display);
#else
    if (display != NULL) lv_disp_flush_ready(display);
#endif
#endif
}


#if LVGL_VERSION_MAJOR == 9
CRITICAL void lcd_draw_large_text(uint32_t x, uint32_t y, const lv_image_dsc_t *img, lv_color_t clr) {
    uint16_t color = lv_color_to_u16(clr);
    if (img->header.cf == LV_COLOR_FORMAT_I1) {
#else
CRITICAL void lcd_draw_large_text(uint32_t x, uint32_t y, const lv_img_dsc_t *img, lv_color_t color) {
    if (img->header.cf == LV_IMG_CF_INDEXED_1BIT) {
#endif
        // images stored as 1bpp, need to iterate over and draw raw
#ifdef DMA_WRITE
        // items are 148*88, so 37 cycles
#define BLOB_LINES 4 
#define BLOB_SIZE (88*BLOB_LINES)
        uint16_t blob[BLOB_SIZE]; // expand and dma draw
        uint16_t blob2[BLOB_SIZE]; // expand and dma draw
        uint16_t *cb = NULL;
        uint8_t *data = (uint8_t *) img->data;
        data += 8;
        int cycles = 0;
        cb = (cb == blob) ? blob2 : blob ;
        while(cycles < 148 / BLOB_LINES) {
            // expand
            int32_t i = 0;
            while(i < BLOB_SIZE) {
                register uint32_t vdata = *data;
#if LVGL_VERSION_MAJOR == 8
                cb[i++] = (vdata & 0x80) ? 0x0000 : color.full;
                cb[i++] = (vdata & 0x40) ? 0x0000 : color.full;
                cb[i++] = (vdata & 0x20) ? 0x0000 : color.full;
                cb[i++] = (vdata & 0x10) ? 0x0000 : color.full;
                cb[i++] = (vdata & 0x08) ? 0x0000 : color.full;
                cb[i++] = (vdata & 0x04) ? 0x0000 : color.full;
                cb[i++] = (vdata & 0x02) ? 0x0000 : color.full;
                cb[i++] = (vdata & 0x01) ? 0x0000 : color.full;
#else 
                cb[i++] = (vdata & 0x80) ? 0x0000 : color;
                cb[i++] = (vdata & 0x40) ? 0x0000 : color;
                cb[i++] = (vdata & 0x20) ? 0x0000 : color;
                cb[i++] = (vdata & 0x10) ? 0x0000 : color;
                cb[i++] = (vdata & 0x08) ? 0x0000 : color;
                cb[i++] = (vdata & 0x04) ? 0x0000 : color;
                cb[i++] = (vdata & 0x02) ? 0x0000 : color;
                cb[i++] = (vdata & 0x01) ? 0x0000 : color;
#endif
                data++;
            }
            // wait
            while(!dma_ready);
            // set address
            lcd_set_address_window(x, y, x + img->header.w - 1, y + (BLOB_LINES - 1) < (y + img->header.h - 1) ? y + (BLOB_LINES - 1) : (y + img->header.h - 1));
            // send
            write_cmd(ILI_MEMORY_WRITE);
            DATA;
            /* dma_write(cb, BLOB_SIZE, x + img->header.w - 1, y + (BLOB_LINES - 1) < (y + img->header.h - 1) ? y + (BLOB_LINES - 1) : (y + img->header.h - 1)); */
            y += BLOB_LINES;
            cycles++;
            cb = (cb == blob) ? blob2 : blob;
        }
        while(!dma_ready);
#else
        lcd_set_address_window(x, y, x + img->header.w - 1, y + img->header.h - 1);
        uint32_t length = (img->header.w * img->header.h) >> 3;
        uint8_t *data = (uint8_t *) img->data;
        data += 8;
        write_cmd(ILI_MEMORY_WRITE);
        while(length--) {
            // convert
            register uint32_t vdata = *data;
#if LVGL_VERSION_MAJOR == 8
            write_data((vdata & 0x80) ? 0x0000 : color.full);
            write_data((vdata & 0x40) ? 0x0000 : color.full);
            write_data((vdata & 0x20) ? 0x0000 : color.full);
            write_data((vdata & 0x10) ? 0x0000 : color.full);
            write_data((vdata & 0x08) ? 0x0000 : color.full);
            write_data((vdata & 0x04) ? 0x0000 : color.full);
            write_data((vdata & 0x02) ? 0x0000 : color.full);
            write_data((vdata & 0x01) ? 0x0000 : color.full);
#else 
            write_data((vdata & 0x80) ? 0x0000 : color);
            write_data((vdata & 0x40) ? 0x0000 : color);
            write_data((vdata & 0x20) ? 0x0000 : color);
            write_data((vdata & 0x10) ? 0x0000 : color);
            write_data((vdata & 0x08) ? 0x0000 : color);
            write_data((vdata & 0x04) ? 0x0000 : color);
            write_data((vdata & 0x02) ? 0x0000 : color);
            write_data((vdata & 0x01) ? 0x0000 : color);
#endif
            data++;
        }
#endif
    }
}
